Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: For example, if you assign a literal value of 42 to a new constant without saying what type it is, Swift infers that you want the constant to be an Int, because you have initialized it with a number that looks like an integer:
ja: 例えば、あなたがそれがどんな型であるかについて言うことなく、新しい定数にリテラル値42を代入するならば、スウィフトは、あなたがその定数にIntであって欲しいのだと推測します、なぜならあなたがそれを整数のように見える数で初期化したからです：

source: For example, if you compile your code using the Swift 5 compiler in Swift 4.2 mode, the compiler version is 5 and the language version is 4.2.
ja: 例えば、あなたがSwift 5コンパイラを使ってSwift 4.2モードであなたのコードをコンパイルするならば、コンパイラバージョンは5で、言語バージョンは4.2です。

source: For example, if you compose a tuple from two different types, one with internal access and one with private access, the access level for that compound tuple type will be private.
ja: 例えば、あなたが２つの異なる型、内部アクセスを持つものと非公開アクセスを持つものからタプルを組み立てるならば、その複合のタプル型のためのアクセス水準は非公開になります。

source: For example, if you create a custom class to open a file and write some data to it, you might need to close the file before the class instance is deallocated.
ja: 例えば、あなたがファイルを開いてそれに何かのデータを書くあつらえのクラスを作成するならば、クラスインスタンスが割り当て解除される前に、あなたはファイルを閉じる必要があるでしょう。

source: For example, if you define a file-private class, that class can only be used as the type of a property, or as a function parameter or return type, in the source file in which the file-private class is defined.
ja: 例えば、あなたがあるファイル外非公開のクラスを定義するならば、そのクラスは、プロパティの型として、または関数パラメータや戻り型として、そのファイル外非公開クラスが定義されるソースファイルの中で使われることだけができます。

source: For example, if you have properties that provide thread-safety checks or store their underlying data in a database, you have to write that code on every property.
ja: 例えば、あなたがスレッド安全検査を提供するまたはそれらの基礎をなすデータをデータベースに格納するプロパティそれらを持つならば、あなたはそのコードをあらゆるプロパティ上で書かなければなりません。

source: For example, if you initialize a new string with the four-character word cafe, and then append a COMBINING ACUTE ACCENT (U+0301) to the end of the string, the resulting string will still have a character count of 4, with a fourth character of é, not e:
ja: 例えば、あなたがある新しい文字列を４文字の単語cafeで初期化して、それからCOMBINING ACUTE ACCENT（U+0301）をその文字列の終わりに加えたならば、結果の文字列は依然として文字数4で、eではなく、éの４番目の文字を持ちます：>

source: For example, if you make a function call inside a subscript in a key path expression, the function is called only once as part of evaluating the expression, not every time the key path is used.
ja: 例えば、あなたがキーパス式の中の添え字内で関数呼び出しを作るならば、関数は式の評価の一部としてただ一度だけ呼び出されます、キーパス式が使われるたびごとではなく。

source: For example, if you provide an initial value and a maximum value, Swift uses the init(wrappedValue:maximum:) initializer:
ja: 例えば、あなたが初期値と最大値を提供するならば、スウィフトはinit(wrappedValue:maximum:)イニシャライザを使います：

source: For example, if you write let dict: Dictionary = ["A": 1], the compiler infers that dict has the type Dictionary<String, Int>.
ja: たとえば、あなたがlet dict: Dictionary = ["A": 1]を書くならば、コンパイラはdictが型Dictionary<String, Int>を持つと推測します。

source: For example, if your app uses a custom subclass of UIApplication as its principal class, call the UIApplicationMain(_:_:_:_:) function instead of using this attribute.
ja: 例えば、あなたのアプリがそれの主役クラス（プリンシパルクラス）としてUIApplicationのあつらえのサブクラスを使うならば、UIApplicationMain(_:_:_:_:)関数をこの属性を使用する代わりに呼んでください。

source: For example, if your string is #"Line 1\nLine 2"# and you want to break the line, you can use #"Line 1\#nLine 2"# instead.
ja: 例えば、あなたの文字列が#"Line 1\nLine 2"#であるそしてあなたが行を改めることを望むならば、あなたは#"Line 1\#nLine 2"#を代わりに使用できます。

source: For example, in addition to the values of scalar types, such as integers and characters, your code can branch on the values of any type, including floating-point numbers, strings, tuples, instances of custom classes, and optionals.
ja: たとえば、整数と文字のようなスカラー型の値に加えて、あなたのコードは、浮動小数点数、文字列、タプル、あつらえのクラスのインスタンス、そしてオプショナルを含むあらゆる型の値に関して分岐することができます。

source: For example, in the code below, SomeStruct calls each of the initializers that SomeWrapper defines.
ja: 例えば、下のコードにおいて、SomeStructは、SomeWrapperが定義するイニシャライザそれぞれを呼び出します。

source: For example, in the code below, the closure passed to someFunctionWithEscapingClosure(_:) is an escaping closure, which means it needs to refer to self explicitly.
ja: 例えば、以下のコードにおいて、someFunctionWithEscapingClosure(_:)に渡されるクロージャは脱出クロージャです、それは、それがselfを明示的に参照する必要があるのを意味します。

source: For example, in the declaration let x: Int8 = 42, Swift uses the explicit type annotation (: Int8) to infer that the type of the integer literal 42 is Int8.
ja: 例えば、宣言let x: Int8 = 42において、スウィフトは明示的な型注釈（: Int8）を使って、整数リテラル42の型はInt8であると推論します。

source: For example, in the declaration let str = "Hello, world", the default inferred type of the string literal "Hello, world" is String.
ja: 例えば、宣言let str = "Hello, world"において、文字列リテラル"Hello, world"の省略時の推論される型はStringです。

source: For example, in the following assignment 10 is assigned to x and 20 is ignored:
ja: 例えば、以下の代入において、10はxに代入されて20は無視されます：

source: For example, in the following code x and y have the same value and behavior:
ja: 例えば、以下のコードにおいてxとyは、同じ値と挙動を持ちます。

source: For example, in the following constant declaration, someValue is an identifier pattern that matches the value 42 of type Int:
ja: 例えば、以下の定数宣言において、someValueは、型Intの値42にマッチする識別子パターンです：

source: For example, in the generic function below, the generic parameter T: Comparable indicates that any type argument substituted for the type parameter T must conform to the Comparable protocol.
ja: たとえば、下記の総称体関数において、総称体パラメータT: Comparableは、型パラメータTと置き換えられる任意の型の引数はComparableプロトコルに準拠しなければならないことを示します。

source: For example, instances of a user-defined class named MyClass have the type MyClass.
ja: 例えば、MyClassという名前をつけられるユーザー定義のクラスのインスタンスは、型MyClassを持ちます。

source: For example, instead of writing var x: Int = 0, you can write var x = 0, omitting the type completely—the compiler correctly infers that x names a value of type Int.
ja: 例えば、var x: Int = 0を書く代わりに、あなたは型を完全に省略してvar x = 0と書くことができます ― コンパイラは、xが型Intの値に名をつけると正しく推測します。

source: For example, it’s not possible to write an == operator comparing results returned by this function.
ja: 例えば、この関数によって返される結果を比較する==演算子を書くことは可能ではありません。

source: For example, operator precedence explains why the following expression equals 17.
ja: 例えば、演算子優先順位は、なぜ以下の式が17に等しいのかを説明します。

source: For example, overlapping write accesses to the elements of a tuple produces a conflict:
ja: 例えば、あるタプルの要素いくつかへの書き込みアクセスがオーバーラップすると衝突を生み出します：

source: For example, printing the string literal #"Line 1\nLine 2"# prints the line feed escape sequence (\n) rather than printing the string across two lines.
ja: 例えば、文字列リテラル#"Line 1\nLine 2"#をブリントすることは、行送りエスケープシーケンス（\n）をプリントします、プリントする文字列が２つの行に渡るのではなく。

source: For example, suppose an inventory tracking system needs to track products by two different types of barcode.
ja: 例えば、ある在庫追跡システムが、２つの異なる型のバーコードによって製品を追跡する必要があると思ってください。

source: For example, suppose you want to make a version of Container that includes an iterator, like what the Sequence protocol uses in the standard library.
ja: 例えば、あなたがContainerのあるバージョンを作りたいと仮定してください、それはあるイテレータ、標準ライブラリで使われているSequenceプロトコルのようなものを含みます。

source: For example, suppose you’re writing a module that draws ASCII art shapes.
ja: 例えば、あなたがさまざまなASCIIアート形状を描くモジュールを記述していると仮定してください。

source: For example, the Diccionario type alias declared here has the same generic parameters and constraints as Dictionary.
ja: 例えば、ここで宣言されるDiccionario型エイリアスは、Dictionaryと同じ総称体パラメータと制約を持ちます。

source: For example, the Int16 integer type can hold any signed integer between -32768 and 32767.
ja: 例えば、Int16整数型は、-32768と32767の間のどんな符号つき整数でも持つことができます。

source: For example, the PrettyTextRepresentable protocol, which inherits the TextRepresentable protocol can provide a default implementation of its required prettyTextualDescription property to simply return the result of accessing the textualDescription property:
ja: 例えば、TextRepresentableプロトコルを継承するprettyTextualDescriptionプロパティは、それの必須プロパティprettyTextualDescriptionの省略時の実装を提供して、単にtextualDescriptionプロパティの結果を返すようにできます：

source: For example, the RandomNumberGenerator protocol can be extended to provide a randomBool() method, which uses the result of the required random() method to return a random Bool value:
ja: 例えば、RandomNumberGeneratorプロトコルは拡張されてrandomBool()メソッドを提供することができます、それは必須メソッドのrandom()を利用してランダムなBool値を返すものです：

source: For example, the UntitledDocument subclass below is always named "[Untitled]", and it uses the failable init(name:) initializer from its superclass during initialization.
ja: 例えば、下のUntitledDocumentサブクラスは、常に"[Untitled]"と名前をつけられます、そしてそれは失敗できるinit(name:)イニシャライザをそれのスーパークラスから初期化の間に使います。

source: For example, the asHTML property could be set to a closure that defaults to some text if the text property is nil, in order to prevent the representation from returning an empty HTML tag:
ja: 例えば、asHTMLプロパティは、あるクロージャに設定されることができます、それはtextプロパティがnilならば特に何もしなくともいくらかのテキストになり、その表現が空のHTMLタグを返すことを予防する手段となります。

source: For example, the discardableResult attribute on a function declaration indicates that, although the function returns a value, the compiler shouldn’t generate a warning if the return value is unused.
ja: 例えば、ある関数宣言上でのdiscardableResult属性が指し示すのは、たとえその関数が値を返すとしても、コンパイラは戻り値が使われなくても警告を生成すべきでないということです。

source: For example, the buyFavoriteSnack(person:vendingMachine:) in the example below is also a throwing function, and any errors that the vend(itemNamed:) method throws will propagate up to the point where the buyFavoriteSnack(person:vendingMachine:) function is called.
ja: たとえば、下の例のbuyFavoriteSnack(person:vendingMachine:)もまたスロー関数です、そしてvend(itemNamed:)メソッドがスローするあらゆるエラーは、buyFavoriteSnack(person:vendingMachine:)関数が呼び出される地点へとさかのぼり伝えられます。

source: For example, the < operator has an associativity of none, which means 1 < 2 < 3 is not a valid expression.
ja: 例えば、<演算子は、noneの関係性を持ちます、それは1 < 2 < 3が有効な式でないことを意味します。

source: For example, the assert(condition:message:file:line:) function takes an autoclosure for its condition and message parameters; its condition parameter is evaluated only in debug builds and its message parameter is evaluated only if condition is false.
ja: 例えば、assert(condition:message:file:line:)関数は自動クロージャをそれのconditionとmessageパラメータとして取ります；それのconditionパラメータはデバッグビルドにおいてのみ評価されます、そしてそれのmessageパラメータはconditionがfalseである場合にのみ評価されます。

source: For example, the Swift standard library includes both a top-level min(_:_:) [https://developer.apple.com/documentation/swift/1538339-min/] function and a min() [https://developer.apple.com/documentation/swift/sequence/1641174-min] method for sequences with comparable elements.
ja: 例えば、スウィフト標準ライブラリはトップレベルのmin(_:_:) [https://developer.apple.com/documentation/swift/1538339-min/]関数とmin() [https://developer.apple.com/documentation/swift/sequence/1641174-min]メソッドの両方を、比較可能な要素を持つシーケンスに対して含みます。

source: For example, the above example can be written so any error that isn’t a VendingMachineError is instead caught by the calling function:
ja: 例えば、上の例はVendingMachineErrorでないあらゆるエラーが、呼び出し側の関数によって代わりにキャッチされるように書かれることができます：

source: For example, the addition (+) and subtraction (-) operators belong to the AdditionPrecedence group, and the multiplication (*) and division (/) operators belong to the MultiplicationPrecedence group.
ja: 例えば、加算（+）および減算（-）演算子は、AdditionPrecedenceグルーブに所属し、そして乗算（*）および減算（/）演算子はMultiplicationPrecedenceグルーブに属します。

source: For example, the addition assignment operator (+=) combines addition and assignment into a single operation.
ja: 例えば、加算代入演算子（+=）は、加算と代入を一回の操作に結合します。

source: For example, the addition operator (+) adds two numbers, as in let i = 1 + 2, and the logical AND operator (&&) combines two Boolean values, as in if enteredDoorCode && passedRetinaScan.
ja: 例えば、加算演算子（+）は、let i = 1 + 2のように、２つの数を加えてひとつにします、そして論理積演算子（&&）は、if enteredDoorCode && passedRetinaScanのように、２つのブール値を組み合わせます。

source: For example, the class below ensures that the side length of its triangle is always the same as the side length of its square.
ja: 例えば、下のクラスは、その三角形の横の長さが常にその正方形の横の長さと同じものであることを確実にします。

source: For example, the code below shows an instance method f whose return type is Self.
ja: 例えば、以下のコードはインスタンスメソッドfを示します、それの戻り型はSelfです。

source: For example, the code in resize(to:) accesses height and width using their property wrapper.
ja: 例えば、resize(to:)でのコードは、heightとwidthにそれらのプロパティラッパーを使ってアクセスします。

source: For example, the declarations of SubProtocol below are equivalent:
ja: 例えば、下のSubProtocolの宣言は同等です：

source: For example, the definition of PQR in the code below is equivalent to P & Q & R.
ja: 例えば、以下のコードでのPQRの定義は、P & Q & Rと同等です。

source: For example, the expression 2 + 3 * 5 is initially understood as a flat list of five items, 2, +, 3, *, and 5.
ja: 例えば、式2 + 3 * 5は、最初に５つの項目、2、+、3、*、そして5の平坦なリストとして理解されます。

source: For example, the expression (5 + 4) * 2 has a number on the right-hand side of the multiplication and another expression on the left-hand side of the multiplication.
ja: 例えば、式(5 + 4) * 2は、１つの数を掛け算の右手側に、そして別の式を掛け算の左手側に持ちます。

source: For example, the following are equivalent:
ja: 例えば、以下のものはどれも等しいです：

source: For example, the following code contains both a read access and a write access:
ja: 例えば、以下のコードは読み出しアクセスと書き込みアクセスの両方を含みます：

source: For example, the following code declares a ComparableContainer protocol that requires Item to conform to Comparable:
ja: 例えば、以下のコードはComparableContainerプロトコルを宣言します、それはItemがComparableに準拠することを要求します：

source: For example, the following code defines a version of Container that requires the items in the container to be equatable.
ja: 例えば、以下のコードはContainerのあるバージョンを定義します、それはコンテナの中の項目に同等評価可能であることを要求するものです。

source: For example, the following code isn’t valid because the element 0 in the tuple pattern (x, 0) is an expression pattern:
ja: 例えば、以下のコードは有効ではありません、タプルパターン(x, 0)の中の要素0が式パターンであるためです：

source: For example, the following code iterates through the closed range 1...3, ignoring the current value of the range on each iteration of the loop:
ja: 例えば、完結範囲1...3のすべてに繰り返す以下のコードは、ループの各繰り返しにおいて範囲の現在の値を無視しています：

source: For example, the following code matches against all three cases of the VendingMachineError enumeration.
ja: 例えば、以下のコードはVendingMachineError列挙の３つのケース節すべてに対して適合します。

source: For example, the following code throws an error to indicate that five additional coins are needed by the vending machine:
ja: 例えば、以下のコードはあるエラーをスローして、５つの追加のコインが自動販売機に必要とされることを示します。

source: For example, the following code uses a loadImage(atPath:) function, which loads the image resource at a given path or throws an error if the image can’t be loaded.
ja: 例えば、以下のコードはloadImage(atPath:)関数を使います、それは画像リソースを与えられたパスでロードします、または画像がロードできないならばエラーをスローします。

source: For example, the following code uses several approaches to fetch data, or returns nil if all of the approaches fail.
ja: 例えば、以下のコードはいくつかの取り組みを使ってデータを取ってきます、またはすべての取り組みが失敗するならばnilを返します。

source: For example, the following is invalid because the catch clause would handle the error thrown by alwaysThrows().
ja: 例えば、以下のものは無効です、なぜならcatch節がalwaysThrows()によってスローされるエラーを取り扱おうとするからです。

source: For example, the following listing shows chained method calls split over several lines:
ja: 例えば、以下のコード出力は、連結されたメソッド呼び出しがいくつかの行に分けられるのを示します：

source: For example, the following protocol can be adopted only by class types:
ja: 例えば、以下のプロトコルはクラス型によってのみ採用されることができます：

source: For example, the function in the following code returns a type that depends on its caller:
ja: 例えば、以下のコードの関数は、それの呼び出し側に依存する、ある型を返します。

source: For example, the function in the following example returns a trapezoid without exposing the underlying type of that shape.
ja: 例えば、以下の例での関数は、ある台形を、その形状の基礎をなす型を露出することなしに返します。

source: For example, the function type (Int) -> (Int) -> Int is understood as (Int) -> ((Int) -> Int)—that is, a function that takes an Int and returns another function that takes and returns an Int.
ja: 例えば、関数型(Int) -> (Int) -> Intは、(Int) -> ((Int) -> Int)として理解されます ― すなわち、ひとつのIntを取って、ひとつのIntを取りそして返す別の関数を返す関数。

source: For example, the initializer for the PurchasedSnack structure in the listing below calls a throwing function as part of the initialization process, and it handles any errors that it encounters by propagating them to its caller.
ja: 例えば、以下のコード出力のPurchasedSnack構造体のためのイニシャライザは、スロー関数を初期化処理の一部として呼び出します、そしてそれは、それが遭遇するどんなエラーもそれの呼び出し側にそれらを伝達することによって取り扱います。

source: For example, the metatype of the class type SomeClass is SomeClass.Type and the metatype of the protocol SomeProtocol is SomeProtocol.Protocol.
ja: 例えば、クラス型SomeClassのメタタイプはSomeClass.Typeです、そして、プロトコルSomeProtocolのメタタイプはSomeProtocol.Protocolです。

source: For example, the structure of a tuple (1, 2) is a comma-separated list of two elements.
ja: 例えば、タプル(1, 2)の構造は、コンマで区切られた２つの要素のリストです。

source: For example, the subtraction operator (-) is left-associative, so the expression 4 - 5 - 6 is grouped as (4 - 5) - 6 and evaluates to -7.
ja: 例えば、減算演算子（-）は左結合です、それで式4 - 5 - 6は(4 - 5) - 6のようにグループにされて、-7に評価されます。

source: For example, the tuple pattern (x, y): (Int, Int) in the constant declaration let (x, y): (Int, Int) = (1, 2) matches only tuple types in which both elements are of type Int.
ja: 例えば、定数宣言let (x, y): (Int, Int) = (1, 2)におけるタプルパターン(x, y): (Int, Int)は、両方の要素が型Intであるタプル型だけにマッチします。

source: For example, the tuple type (Int, (Int, Int)) contains two elements: The first is the named type Int, and the second is another compound type (Int, Int).
ja: たとえば、タプル型(Int, (Int, Int))は、２つの要素を含みます：第一は名前付きの型Intです、そして第二は別の複合の型(Int, Int)です。

source: For example, the type identifier in the following code references the named type MyType that is declared in the ExampleModule module.
ja: 例えば、以下のコードの型識別子は、ExampleModuleモジュールで宣言される名前付きの型MyTypeを参照します。

source: For example, the values of textA and textB in the example below are identical—no runtime concatenation is performed.
ja: たとえば、以下の例のtextAとtextBの値は同一です ― 実行時連結は行われません。

source: For example, the variadic parameter Int... is treated as [Int].
ja: たとえば、可変長パラメータInt...は[Int]とみなされます。

source: For example, there are two things named x in the code below, a variable in the outer scope and a constant in the inner scope, but they both refer to the same object because of reference semantics.
ja: 例えば、xと名前をつけられる２つのものが以下のコードにはあります、外側のスコープの中の変数と内側のスコープの中の定数、しかしそれらは両方とも同じオブジェクトを参照します、なぜなら参照意味論だからです。

source: For example, this protocol, called TextRepresentable, can be implemented by any type that has a way to be represented as text.
ja: 例えば、このプロトコル、TextRepresentableと呼ばれるものは、テキストとして表わされる方法を持つどんな型によってでも実装されることができます。

source: For example, to create a new stack of strings, you write Stack<String>():
ja: 例えば、新しく文字列のスタックを作成するために、あなたはStack<String>()を書きます：

source: For example, use a precondition to check that a subscript is not out of bounds, or to check that a function has been passed a valid value.
ja: 例えば、前提時要件を使って、ある添え字が範囲外でないことを調べてください、またはある関数が有効な値を渡されていることを確認してください。

source: For example, when a computed property or a property with observers is passed as an in-out parameter, its getter is called as part of the function call and its setter is called as part of the function return.
ja: 例えば、計算プロパティまたはオブザーバを持つプロパティがin-outパラメータとして渡される時、それのゲッターは関数呼び出しの一部として呼び出され、それのセッターは関数の戻りの一部として呼び出されます。

source: For example, when integers are used for raw values, the implicit value for each case is one more than the previous case.
ja: 例えば、整数が生の値のために使われるとき、各ケース節に対する暗黙の値は、その前のケース節よりも１つ多くなります。

source: For example, writing shoppingList[shoppingList.count] = "Salt" to try to append an item to the end of the array results in a runtime error.
ja: 例えば、shoppingList[shoppingList.count] = "Salt"と書くことでこの配列の終わりに項目を加えようとするのは実行時エラーという結果になります。

source: For example, you access elements in an Array instance as someArray[index] and elements in a Dictionary instance as someDictionary[key].
ja: 例えば、あなたはあるArrayインスタンスの中の要素にsomeArray[index]として、そしてあるDictionaryインスタンスの中の要素にsomeDictionary[key]のようにアクセスします。

source: For example, you can assign values of implicitly unwrapped optionals to variables, constants, and properties of optionals, and vice versa.
ja: たとえば、あなたは暗黙的にアンラップされるオプショナルの値を、オプショナルの変数、定数、そしてプロパティに代入することができます、その逆もまたできます。

source: For example, you can constrain the associated types of type parameters to conform to protocols.
ja: たとえば、あなたは型パラメータの関連型をいくらかのプロトコルに準拠するように制約することができます。

source: For example, you can create a three-dimensional array of integers using three sets of square brackets:
ja: 例えば、あなたは３つ固めた角括弧を使って整数の三次元配列をつくることができます：

source: For example, you can decompose the elements of a tuple and bind the value of each element to a corresponding identifier pattern.
ja: 例えば、あなたはタプルの要素を分解して、各要素の値を対応する識別子パターンへと縛り付けることができます。

source: For example, you can define a constant or variable to be of a function type and assign an appropriate function to that variable:
ja: 例えば、あなたはある関数型となる定数または変数を定義して、適切な関数をその変数に代入することができます：

source: For example, you can define a public type that can be used in other modules, but whose conformance to an internal protocol can only be used within the internal protocol’s defining module.
ja: たとえば、あなたは、別のモジュール内で使われることができる公開の型を定義することができます、しかし内部プロトコルに準拠するものは、ただその内部プロトコルの定義するモジュール内で使われることができるだけです。

source: For example, you can define an extension to the Collection protocol that applies to any collection whose elements conform to the Equatable protocol.
ja: 例えば、それの要素がEquatableプロトコルに準拠するあらゆるコレクションに適用されるCollectionプロトコルに対して、あなたはある拡張を定義できます。

source: For example, you can refine the behavior of that existing implementation, or store a modified value in an existing inherited variable.
ja: 例えば、あなたはその既存の実施の挙動を洗練させたり、既存の継承された変数に修正された値を格納することができます。

source: For example, you can replace the type parameter Element in Array<Element> with a specialized version of an array, Array<Int>, to form an array whose elements are themselves arrays of integers.
ja: 例えば、あなたはArray<Element>における型パラメータElementを配列の特殊化版、Array<Int>で置き換えて、要素それ自身が整数の配列である配列を作り出すことができます。

source: For example, you can rewrite the above example to compare the point expression with a string representations of points.
ja: 例えば、あなたは上記の例を書き直して、point式をpoint（座標）の文字列表現と比較するようにできます。

source: For example, you can use a defer statement to ensure that file descriptors are closed and manually allocated memory is freed.
ja: 例えば、あなたはdefer文を使ってファイル記述子が閉じられて手動割り当てメモリが解放されることを確実にします。

source: For example, you can use the protocol composition type ProtocolA & ProtocolB & ProtocolC instead of declaring a new protocol that inherits from ProtocolA, ProtocolB, and ProtocolC.
ja: 例えば、プロトコル合成型ProtocolA & ProtocolB & ProtocolCを使うことが、ProtocolA、ProtocolB、そしてProtocolCから継承する新しいプロトコルを宣言する代わりに行えます。

source: For example, you can’t use a private type as the raw-value type of an enumeration with an internal access level.
ja: 例えば、あなたはある非公開型を、内部のアクセス水準をもつ列挙の「生の値」型として使うことができません。

source: For example, you can’t write let b = a += 2.
ja: 例えば、あなたはlet b = a += 2を書くことができません。

source: For example, you can’t write a public protocol that inherits from an internal protocol.
ja: 例えば、あなたは内部のプロトコルから継承する公開のプロトコルを書くことができません。

source: For example, you use declarations to introduce functions and methods, to introduce variables and constants, and to define enumeration, structure, class, and protocol types.
ja: 例えば、あなたは宣言を使うことで、関数やメソッドを導入したり、変数や定数を導入したり、そして列挙、構造体、クラス、そしてプロトコル型を定義します。

source: For example:
ja: 例えば：

source: For examples of conforming types that implement the method requirements of a protocol, see Method Requirements.
ja: あるプロトコルのメソッド要件を満たすものである準拠している型の例のために、メソッド要件を見てください。

source: For examples of conforming types that implement the property requirements of a protocol, see Property Requirements.
ja: あるプロトコルのプロパティ要件を実装するものである、準拠している型の例のために、プロパティ要件を見てください。

source: For examples of how to use a break statement, see Break and Labeled Statements in Control Flow.
ja: break文を使う方法の例のために、ブレークとラベルをつけられた文を章制御の流れで見てください。

source: For examples of how to use a continue statement, see Continue and Labeled Statements in Control Flow.
ja: continue文を使う方法の例のために、続けるとラベルをつけられた文を章制御の流れで見てください。
